//{$D-,L-}
Unit hzpy;
Interface
{ }
//±¾µ¥ÔªÊÇ°æÖ÷»¨·ÑÁË´óÁ¿¾«Á¦¶Ô¶ş¼¶×Ö¿âÊÖ¹¤´¦Àíºó±àĞ´µÄ£¬
//ÔÚÕâÀï¸ø³öÔ´´úÂë£¬Ï£ÍûÅóÓÑÃÇÔÚÊ¹ÓÃºóÌá³ö±¦¹óÒâ¼û£¬Èç¹û
//ÄúĞŞ¸Ä¡¢ÍêÉÆÁË´Ë´úÂë£¬Ï£ÍûÄÜ¼Ä¸ø°æÖ÷Ò»·İ£¬°æÖ÷ÔÚ´ËĞ»Ğ»Äú£¡
//»¶Ó­·ÃÎÊÖ÷Ò³http://lkpc.126.COM
//Email:  fda@football.com.cn

Function  getpy1(S:String):String;
function GetPY2( hzchar:string):char;

Implementation


function GetPY2( hzchar:string):char;
begin
  case WORD(hzchar[1]) shl 8 + WORD(hzchar[2]) of
    $B0A1..$B0C4 : result := 'a';
    $B0C5..$B2C0 : result := 'b';
    $B2C1..$B4ED : result := 'c';
    $B4EE..$B6E9 : result := 'd';
    $B6EA..$B7A1 : result := 'e';
    $B7A2..$B8C0 : result := 'f';
    $B8C1..$B9FD : result := 'g';
    $B9FE..$BBF6 : result := 'h';
    $BBF7..$BFA5 : result := 'j';
    $BFA6..$C0AB : result := 'k';
    $C0AC..$C2E7 : result := 'l';
    $C2E8..$C4C2 : result := 'm';
    $C4C3..$C5B5 : result := 'n';
    $C5B6..$C5BD : result := 'o';
    $C5BE..$C6D9 : result := 'p';
    $C6DA..$C8BA : result := 'q';
    $C8BB..$C8F5 : result := 'r';
    $C8F6..$CBF9 : result := 's';
    $CBFA..$CDD9 : result := 't';
    $CDDA..$CEF3 : result := 'w';
    $CEF4..$D1B8 : result := 'x';
    $D1B9..$D4D0 : result := 'y';
    $D4D1..$D7F9 : result := 'z';
  else
    result := char(0);
  end;
end;

function getpy1(S:String):String;
var
cstr,hz,py,py1:string;
hstr:array[1..23] of string;
i,j,k:integer;
const zm:array[1..23] of char='abcdefghjklmnopqrstwxyz';
begin
cstr:='0123456789abcdefghijklmnopqrstuvwxyz';
cstr:=cstr+'ABCDEFGHIJKLMNOPQRSTUVWXYZ';
cstr:=cstr+'!.#$%()*+-,/[\|^~`@{}_';

hstr[1]:='ï¹ Şß àÈ àÉ æÈ è¨ êÓ íÁ ïÍ ö° ÚÏ Ûû Şî áí âÖ èñ ï§ ğÆ ÷ö ';
hstr[1]:=hstr[1]+'Ïù Ûê ŞÖ à» á® âÚ åÛ æÁ æñ éá ñú òü öË ÷¡ ÷é ';

hstr[2]:='ÜØ İÃ á± å± îÙ ôÎ öÑ ÷É Şã êş Úæ Ûà îÓ ñ£ ñ­ ô² İò äº ÆØ ';
hstr[2]:=hstr[2]+'İá æß ìÒ ğ± ñÙ õÀ öµ ØÃ Úé Úı Ûı İÉ İí ßÂ ã£ íÕ ğÇ ñØ öÍ ÷¹ º» ';
hstr[2]:=hstr[2]+'ÛÎ ÛĞ êÚ ï¼ àÔ ê´ Ø° ÙÂ Ûı ÜÅ Üê İ© İÉ Şµ ßÁ ßÙ áù âØ ã¹ ää å¨ ';
hstr[2]:=hstr[2]+'åö åş æ¾ æÔ èµ êÚ î¢ î¯ îé ïõ ñÔ óÙ óë ó÷ ô° ôÅ õÏ ÷Â ØÒ ÛÍ ÜĞ ';
hstr[2]:=hstr[2]+'âí ãê çÂ ì® ìÔ í¾ íÜ ñ¹ ñÛ òù óÖ öı æ» æô è¼ ì© ì­ ïÚ ïğ ñ¦ ñÑ ';
hstr[2]:=hstr[2]+'÷§ ÷Ô õ¿ ÙÏ áÙ çÍ çã éÄ éë ë÷ ïÙ ÷Æ ÷Ş Ù÷ Úû Şğ éÄ °Ø ²· ØÃ Ùñ ';
hstr[2]:=hstr[2]+'à£ âÄ éŞ êş ë¢ íç îà ğ¾ ô¤ õÀ õË õÛ ß² åÍ ê³ êÎ îĞ îß õ³ ';

hstr[3]:='àê íå åî æî è² ôÓ ÷õ àĞ äî ó© ô½ âü á¯ ä¹ É² Ôû àê âª âÇ ãâ æ± è¾ é« ';
hstr[3]:=hstr[3]+'é¶ éß ïÊ ïï ñÃ Ù­ îÎ ğû ò² Ùæ ÚÆ İÛ âÜ âã äı å¤ åî åñ æ¿ æö êè ';
hstr[3]:=hstr[3]+'ìø ïâ ó¸ õğ ÌÈ Øö ÛË ÜÉ İÅ áä âê ã® ãÑ æ½ æÏ êÆ ë© öğ ´Â ½Ë â÷ ';
hstr[3]:=hstr[3]+'êË ìÌ ñé Ûå íº ³» Ø÷ ÚÈ Úß ŞÓ àÁ å· è¡ é´ í× ö³ ³Ò ³Ó Ø© Ûô àá ';
hstr[3]:=hstr[3]+'èÇ èß ëó îª îñ îõ ñÎ òÉ õ¨ ÙÑ Ûæ Ü¯ Üİ ß³ ßê à´ àÍ âÁ æÊ ë· í÷ ';
hstr[3]:=hstr[3]+'ğ· ñ¡ ñİ ò¿ ó¤ ó× óø ôù õØ ÷Î Üû âç ã¿ ï¥ ô© ô¾ Ù± àü ã° ñ¬ öÅ ';
hstr[3]:=hstr[3]+'Ğó Ø¡ Û» âğ ãÀ ç© èÆ èú éË ñÒ òÜ õé ÷í Şõ ëú õß à¨ àÜ â¶ å× çİ ';
hstr[3]:=hstr[3]+'ë° îË ô­ âë Úï é¢ é³ Üë ßÚ ìô ğË ôÙ é¨ ê£ ëí İı áŞ â§ éã õ¡ õ¾ ';
hstr[3]:=hstr[3]+'õí ÔÜ Ùà ß¥ ìà ïé İÍ ßı ã² è­ éÁ ë¥ ö¿ ââ ñå ØÈ áÏ ëâ ï± ïó ğî ';
hstr[3]:=hstr[3]+'ğû õº õã ';

hstr[4]:='ŞÇ ßÕ àª âò æ§ í³ ğã ñ× óÎ ÷° ÷² Ü¤ ß° ß¾ á· åÊ ææ çª çé ÷ì ';
hstr[4]:=hstr[4]+'µ® ÙÙ İÌ à¢ å£ éé êæ íñ ğã ğ÷ ñõ óì ÚÔ ÛÊ İĞ å´ í¸ ñÉ ß¶ àü âá ';
hstr[4]:=hstr[4]+'ë® ìâ ôî ï½ àâ áØ ê­ íã ïë ô£ Øµ Ùá Ú® ÚĞ Û¡ Ûæ İ¶ àÖ æ· ç° èÜ ';
hstr[4]:=hstr[4]+'é¦ êë íÆ íÚ íû ïá ôÆ ÷¾ àÇ Úç Ûã áÛ çè îä ñ° ñ² ô¡ õÚ îö ï¢ õõ ';
hstr[4]:=hstr[4]+'öô Ûì Ü¦ Şé à© ëº ğ¬ ñó õÚ õŞ öø Øê à¤ çà ëë íÖ î® îú ğÛ ñô ôú ';
hstr[4]:=hstr[4]+'îû Ûí ßË á´ á¼ ë± ëË ëØ íÏ ğ´ İú ñ¼ ò½ óû Ü¶ à½ äÂ èü ë¹ ó¼ óÆ ';
hstr[4]:=hstr[4]+'÷Ç ÷ò é² ìÑ óı í¡ í­ íÔ ãç ìÀ í» íâ íï ïæ õ» ÍÔ ßÍ ßá ãõ ç¶ èŞ ';
hstr[4]:=hstr[4]+'îì ñÖ õâ ';

hstr[5]:='Ø¬ ÚÌ ÛÑ ÜÃ İ­ İà ßÀ ãµ åí æ¹ éî ëñ ï° ïÉ ğÊ ò¦ öù ÚÀ İì Şô Ù¦ åÇ çí îï ğ¹ öÜ ';

hstr[6]:='ÛÒ íÀ Ş¬ ŞÀ á¦ èó ìÜ î² õì ·» Úú áİ èÊ îÕ ô³ öĞ ÜÀ áô ã­ äÇ åú ç³ é¼ ëè ';
hstr[6]:=hstr[6]+'ì³ ìé ïĞ ğò òã óõ ôä ö­ öî ÙÇ å¯ çã èû ö÷ ÷÷ Ùº Ûº İ× ßô ãã í¿ ó¾ ';
hstr[6]:=hstr[6]+'Ùë Ùì Û® Ü½ ÜÀ ÜŞ Üò İ³ İÊ ŞÔ ß» á¥ âö äæ åõ æÚ æâ ç¦ ç¨ èõ êç ';
hstr[6]:=hstr[6]+'ìğ íÉ íê íë î· ïû ğ¥ ò¶ òİ òğ òó ôï õÃ õÆ öÖ öû ';

hstr[7]:='ŞÎ æØ æÙ ê¸ îÅ Ø¤ Úë Ûò ê® êà Ûá ÜÕ ŞÏ ß¦ ãï äÆ ä÷ ç¤ éÏ êº í· ğá ôû ';
hstr[7]:=hstr[7]+'í° î¸ óà Øº Ú¾ Û¬ Ş» çÉ éÀ éÂ ê½ ï¯ ¿© ÒÙ Øª Øî ÛÁ ÛÙ Üª àÃ æü ';
hstr[7]:=hstr[7]+'ë¡ ëõ íÑ ïÓ ñË ò¢ ò´ ô´ ÷À Ø¨ İ¢ ßç ôŞ ßì âÙ ç® öá çî ëÅ ò¼ ö¡ ';
hstr[7]:=hstr[7]+'Øş Ú¸ á¸ åÜ æÅ çÃ èÛ êí ì° óÑ óô ÷¸ ØÅ Ú¬ İÔ ßÉ áÄ ãé èô éï êô ';
hstr[7]:=hstr[7]+'êö ëû ì± î­ î¹ îÜ ïÀ ğ³ ğÀ ğó òÁ ôş õı öñ ÷½ ØÔ Ú´ ßÉ èé ëÒ ğ» ';
hstr[7]:=hstr[7]+'ÂÚ ÙÄ İ¸ Şè äÊ îÂ ğÙ ñæ ÷¤ ßÛ áî èæ ë× ¿ş È² ØĞ ØÛ âÑ å³ æ£ èí ';
hstr[7]:=hstr[7]+'êÁ êĞ ğ§ óş öÙ ÷¬ Ùò çµ íŞ öç ÎĞ Ùå Ûö Şâ ßÃ àş áÆ â£ é¤ ë½ ñø òä òå ';

hstr[8]:='¸ò Ïº îş ºÙ ¿È àË ëÜ õ° Úõ İÕ Şş ãÛ å« êÏ ìÊ ñü ò¥ òÀ ÷ı ãì ç¬ çñ ñş ¸ä ';
hstr[8]:=hstr[8]+'ºÑ İï Ş¶ àÆ àã å© å° ê» ğ© ò« òº Ú­ ÛÀ ÛÖ àÀ ãØ æü êÂ îÁ ò¢ òÂ ôç ';
hstr[8]:=hstr[8]+'Ş¿ çñ èì Ùä Ùê Ú§ İ¦ Ş® Ş° ãÈ ãü Ü© áá åË ğú óó ô× ö× ÷¿ Ùü ßü àñ ';
hstr[8]:=hstr[8]+'á² â© âï ã± ä° äï çú éÎ éõ ì² ìÃ ìÎ ìæ ìè ìï ğ­ ğÀ ğÉ ğ× óË õ­ õú ';
hstr[8]:=hstr[8]+'æè èë í¹ îü õ× Û¨ Û¼ İÈ ß§ à÷ âµ ä¡ ä½ äñ å¾ åÕ çÙ ïÌ öé ÷ß Úò áå ';
hstr[8]:=hstr[8]+'äÒ äê åØ è« ëÁ ñ¥ ó¨ óò öü Üî Üö Ş¥ ßÔ ßÜ à¹ ãÄ ä§ ä« åç çÀ çõ èí ';
hstr[8]:=hstr[8]+'êÍ í£ ò³ ó³ ÷â Ú» âÆ ãÔ äã Øå Ş½ ß« àë â· îØ ïÁ ïì ñë ó¶ ';

hstr[9]:='Ø¢ Ø½ ØÀ ØŞ Ù¥ ÙÊ Úµ ÛÔ Ü¸ ÜÁ Üù İğ Şª Şá ß´ ßÒ ßâ ßó á§ áÕ ä© åì æ÷ çÜ ';
hstr[9]:=hstr[9]+'çá é® éê êª ê« êå êé ê÷ ì´ í¶ î¿ ïú ğ¢ ñ¤ ò± óÅ óÇ ôß õÒ õÕ ö« öİ ';
hstr[9]:=hstr[9]+'öê ÷Ù ÷ä ØÅ Ù¤ Û£ İç áµ ä¤ åÈ çì ê© ëÎ í¢ îò ïØ ğè ğı ñÊ òÌ óÕ ';
hstr[9]:=hstr[9]+'ôÂ õÊ ÙÔ ÚÉ ÚÙ İÑ İó Şö àî äÕ å¿ åÀ çÌ èÅ é¥ ê§ ê¯ êğ êù ë¦ ëì ';
hstr[9]:=hstr[9]+'íú ïµ ğÏ ñĞ óÈ ôå õÂ õİ öä ÷µ ¼ª °² Üü ä® ç­ çÖ êñ íä ñğ ôİ ôø ';
hstr[9]:=hstr[9]+'ÙÕ Ü´ Üú ŞØ àİ á½ áè äĞ æ¯ ë¸ ğ¨ ğÔ òÔ õ´ õÓ öŞ ÙÊ Ú¦ Úµ Ş× à® ';
hstr[9]:=hstr[9]+'àµ æ¼ æİ èî íÙ ğÜ ò¡ ò» ôÉ öÚ ÷º ¼¢ ¶ö Úá İ£ İÀ àä âË âÛ æ¡ çÆ ';
hstr[9]:=hstr[9]+'èª éÈ êá êî ñÆ ØÙ ÙÓ Úå İ¼ â° ã½ ãş åÉ åò æº ëÂ ëÖ ëæ ìº ö¦ åÄ ';
hstr[9]:=hstr[9]+'êÁ ìç ÙÖ à± ãÎ èÑ èê ğ¯ ğÕ ôñ ÷İ ÙÆ Úª ÜÄ ÜÚ Üì Şä åá åğ è¢ èÛ ';
hstr[9]:=hstr[9]+'é§ é° é· éÙ êø ì« îÒ ï¸ ñÀ ñÕ ôò õ¶ õá ö´ öÂ öÄ ÷¶ Û² áú ä¸ èğ ';
hstr[9]:=hstr[9]+'îÃ ïÃ ïÔ öÁ ØÊ Øã ÚÜ ÛÇ Ş§ àµ àÙ àå áÈ â± æŞ çå èö éÓ ìß ïã õê ';
hstr[9]:=hstr[9]+'õû ¾Ş ¶î ŞÜ ñä óŞ ÷å ';

hstr[10]:='Øû ßÇ ëÌ ØÜ Ûî İÜ âé âı îø ï´ ïÇ Ù© İ¨ ãÛ ê¬ íè î« Øø ãÊ îÖ åê èà ';
hstr[10]:=hstr[10]+'êû îí à¾ á³ ã¡ äÛ æì ç¼ çæ éğ ë´ î§ îİ ï¾ ïı ğâ ñ½ ò¤ òò ÷Á ';
hstr[10]:=hstr[10]+'ñÌ ï¬ ÙÅ áÇ óí ÜÒ Ş¢ ßµ íî óØ ØÚ Ü¥ à· ç« ÷¼ Ù¨ ¿ë Øá Û¦ ßà ';
hstr[10]:=hstr[10]+'áö ä« ëÚ ÷Å Ú² Ú¿ Ú÷ ÛÛ ŞÅ ßÑ æş êÜ Ø¸ ØÑ Ùç Úó İŞ Şñ à­ à° ';
hstr[10]:=hstr[10]+'ã¦ ã´ åÓ êÒ î¥ ñù òñ óñ õÍ ã§ ãÍ çû ï¿ õ« öï ÷Õ èé òÒ ';

hstr[11]:='Øİ åå ê¹ íÇ ğø áÁ áâ äµ äş êã íù ïª ñ® ô¥ á° äí é­ ìµ î½ ïç ñÜ ';
hstr[11]:=hstr[11]+'İ¹ İõ à¥ ãÏ ï¶ ïü òë ÁÊ ßë áÀ èá îî ï© ğì ñì õ² Øì ß· ãî ÷¦ ';
hstr[11]:=hstr[11]+'Ùú Ú³ àÏ æĞ çĞ éÛ ñç õª Ü¨ ã¶ Øª Ù³ Ùµ Ûª ÛŞ ÜÂ İ° İñ Ş¼ ß¿ ';
hstr[11]:=hstr[11]+'à¦ à¬ áû ã¦ äà å¢ åÎ æ² æË æê çÊ èÀ èİ éö ìå íÂ îº î¾ ï® ğ¿ ';
hstr[11]:=hstr[11]+'ğİ ğß òÃ òÛ ó» óÒ óö ôÏ õ· õÈ ö¨ öâ ÷¯ ÷ó İü ŞÆ äò å¥ çö é¬ ';
hstr[11]:=hstr[11]+'éç ì¡ ñÍ ñÏ ó¹ öã Á¢ °¸ Ü® İ¹ é£ õÔ ö¦ ÷Ë Ş¤ ŞÍ àÚ â² å¼ çÔ ';
hstr[11]:=hstr[11]+'îÉ ğÓ Ùı Ûø Şæ ßÖ ä£ ôó õñ ÷à İş ßø á× âŞ ãÁ åà éİ ê¥ ì¢ î¬ ';
hstr[11]:=hstr[11]+'ôÔ õï Û¹ Üß ßÊ àò ãö ç± èÚ èù ê² ñö òÈ ôá öì ä¯ åŞ æò ç¸ ì¼ ';
hstr[11]:=hstr[11]+'ìÖ ï³ ïÖ ğÒ öÌ Ü× ãñ çç èĞ ëÊ íÃ ñª ÙÍ İä à¶ áĞ ïÎ ğü ñï ò÷ ';
hstr[11]:=hstr[11]+'÷Ã Ûä Ş¤ ß£ àà ãÌ ãò äË äõ åÖ è´ èÓ éµ éÖ éñ éû ê¤ ëª ëÍ ëö ';
hstr[11]:=hstr[11]+'ïå ïù ğµ ğØ ñÚ óü ôµ öÔ ÂÎ ÂÏ ÂĞ Ùõ æ® èï ğ½ öÇ ï² àğ ÙÀ Ùù ';
hstr[11]:=hstr[11]+'Üı ŞÛ Şû â¤ ãø äğ çó é¡ ëá íÑ ïİ ñ§ öÃ ';

hstr[12]:='ßé áï æÖ è¿ ó¡ Û½ İ¤ ö² Ü¬ á£ çÏ ì× ïÜ ò© òı ÷© ÷´ Úø äİ íË òş ';
hstr[12]:=hstr[12]+'Ùó Üâ á¹ ã÷ è£ êÄ êó ë£ ì¸ í® î¦ ó± ÷Ö ÷á İ® áÒ â­ ä¼ äØ é¹ ';
hstr[12]:=hstr[12]+'ïÑ ğÌ ñÇ ÷È ŞÑ ìË í¯ îÍ ÛÂ İù Ş« ãÂ ëü íæ òµ òì ó· ô» ô¿ ØÂ ';
hstr[12]:=hstr[12]+'Ú× ŞÂ ßä à× â¨ ãè åµ åô ëß ìò ôÍ ôé ÷ã ÷ç ãæ äÅ äÏ ëï íí ß÷ ';
hstr[12]:=hstr[12]+'åã ç¿ çÑ èÂ íµ íğ ğÅ Ø¿ ßã óº óú Üå áº ãÉ ãı çÅ çä çë íª ö¼ ';
hstr[12]:=hstr[12]+'÷ª Ú¤ Üø äé êÔ î¨ õ¤ ÚÓ ÜÔ İë âÉ æÆ éâ ïÒ ï÷ ñ¢ ñò õö õø Ù° ';
hstr[12]:=hstr[12]+'ßè çÑ íø òÖ òú öÊ Øï Ûé ÜÙ ãå ë¤ îâ ';

hstr[13]:='Şà ëÇ ïÕ ñÄ Ø¾ Üµ İÁ èÍ à« àî àï éª ëî òï ôö ß­ àì âÎ êÙ Ø« Ûñ ßÎ â® ';
hstr[13]:=hstr[13]+'è§ íĞ îó òÍ Ú« í¥ Ù£ Ûè â¥ âõ êÇ ì» ìò í« íş îê öò Ø¥ Ûş éı ';
hstr[13]:=hstr[13]+'ğ¤ öÓ öó Üà æÕ ëå ôÁ Ø¿ Úí ŞÁ à¿ ò¨ ô« õæ Øú ÜÑ ßÌ å¸ ñ÷ ŞÖ ';
hstr[13]:=hstr[13]+'áğ âî æ¤ Ù¯ ßæ ññ åó æÀ æÛ æå í¤ îÏ ô¬ ÙĞ Şù ßö ï» ';

hstr[14]:='Ú© âæ ê± ñî ';

hstr[15]:='İâ èË îÙ óá Ù½ İå ŞÕ ãİ ãú ñÈ ñá ó´ õç áİ äè åÌ ó¦ ŞË áó âÒ ëã ğå àÎ ';
hstr[15]:=hstr[15]+'àú ì· ïÂ õ¬ ö¬ äÔ Ü¡ àØ âñ ó² Ø§ Øò Úé Úğ Úü Û¯ ÛÜ Ûı Ü± ÜÅ ';
hstr[15]:=hstr[15]+'ß¨ ßÁ àè âÏ äÄ æÇ ç¢ èÁ ê¶ î¢ î¼ îë ñ± ñÔ ñâ ò· òç õù ÚÒ æé ';
hstr[15]:=hstr[15]+'çÂ êú ëİ ôæ õä Øâ İ³ àÑ æÎ æô çÎ éè î© óª ÜÖ ë­ æ° æÉ é¯ êò ';
hstr[15]:=hstr[15]+'ò­ Ù· æ³ öÒ ØÏ Úé Û¶ ãø çê ê· îÇ îŞ îà ğ« óÍ Ùö Şå Ùé àÛ äß ';
hstr[15]:=hstr[15]+'å§ è± ë« ïä ïè õë ';

hstr[16]:='Ø½ ØÁ Ù¹ Ûß Ü» ÜÎ Üù İ½ İÂ İİ Ş­ àÒ á¨ áª á« ãà ä¿ æë ç² ç÷ çù è½ èç ';
hstr[16]:=hstr[16]+'éÊ êÈ ì¥ ì÷ í¬ íÓ ñı òÓ òà ôë ôì õè ÷¢ ÷è İÖ ñÊ ÷Ä Ù» Ùİ Úä ';
hstr[16]:=hstr[16]+'Ü· ÜÍ Üç İ¡ Şç á© ã¥ ã» å¹ åº å½ ç× èı êù ëÉ í© îÔ ò¯ óè óé ';
hstr[16]:=hstr[16]+'ãŞ æÍ éÉ ê¨ ìÁ ïº ïÏ ïê ñß òŞ ôÇ õÄ Øä Ú½ ÚÛ Üñ á½ ã¸ ã¾ çØ ';
hstr[16]:=hstr[16]+'éÔ íÍ õÎ ÷³ Û§ ã« ã» æª êü ïÆ óæ ÜË Şì ßÄ àº àß âÛ äÚ éÕ ï· ';
hstr[16]:=hstr[16]+'ñæ ñû òû ôÀ ÜÜ àõ éÑ íà òß óÀ óä ôì ö¥ öë ÷ô Úö Üä ñ· òË óÌ ';
hstr[16]:=hstr[16]+'õ¼ öÆ Ù´ ÛÏ áì äĞ åÏ åÙ é± êä ò° òÇ òø ôÃ ôÜ öú ÷ü Ú° Û¾ ÜÄ ';
hstr[16]:=hstr[16]+'Ş¡ Ş¾ á« áé ãÖ è³ êï ë¬ ëÔ ìî íá ğ¶ ñ³ òĞ ó½ ôğ öÄ ÷ñ Ú¹ Üõ ';
hstr[16]:=hstr[16]+'ãª ç¹ éú î° îı òé óÜ ÷Ü ã× ãÚ í¨ åÒ ';

hstr[17]:='ÜÛ òÅ ÷× ìü ğ¦ Üé æ¬ èã Øğ Üó İØ â¿ éí áÉ áõ éÅ ëÀ òî ôÛ õå ÷· İê Ş¸ ';
hstr[17]:=hstr[17]+'àé ä² äá å¦ çÈ ï¨ ñà ò¬ ëÃ ÜÇ Ş¨ èÄ î£ ò¸ Ù¼ ';

hstr[18]:='Ø¦ Øí êı ëÛ ìª àç âÌ ë§ ôÖ íß òª Ü£ çÒ çØ ëı ğş öş ØÄ ï¤ ßş àÄ êı ì¦ ';
hstr[18]:=hstr[18]+'ï¡ ğğ ôÄ ö® öè Øß Ú¨ Û· Ûï ÜÏ äú æ© æÓ æó ëş ìø îÌ ğŞ óµ ô® ';
hstr[18]:=hstr[18]+'õÇ ÷­ Ûğ ç´ éä ìØ õü Û¿ Üæ äû è¼ òÙ óâ ô¹ Éå ØÇ ÙÜ ß¡ â¦ äÜ ';
hstr[18]:=hstr[18]+'ì¨ î´ ÷ê Ú· ÚÅ İ· İØ ßÓ äÉ é© ëÏ ïò ò× áÓ äÅ êÉ íò óÏ ÊÈ ÊÉ ';
hstr[18]:=hstr[18]+'ÊË ÊÌ ÊÑ ÚÖ Ûõ İª İé ß± éø êÛ ìÂ îæ ó§ óÂ óß õ§ õ¹ öå öõ á÷ ';
hstr[18]:=hstr[18]+'ç· ô¼ Êò Ù¿ ÛÓ İÄ Şó ãğ äø æ­ ç£ ë¨ ëò ì¯ ïø à§ ó° ãÅ äÌ ãñ ';
hstr[18]:=hstr[18]+'æ× İô Ş÷ åù éÃ îå ËÃ ËÅ ËÈ ØË Ù¹ Ùî ÛÌ ßĞ ãá ãô äù æ¦ æá çÁ ';
hstr[18]:=hstr[18]+'ìë ïÈ ğ¸ ñê òÏ óÓ ËË ËÏ ËĞ Ú¡ İ¿ áÂ áÔ âì ã¤ äÁ ñµ Ş´ à² àÕ ';
hstr[18]:=hstr[18]+'âÈ äÑ ì¬ î¤ ïË òô Ùí ÚÕ İø à¼ ãº ä³ óù ö¢ öÕ Ëâ â¡ Ëå Ëç Ëè ';
hstr[18]:=hstr[18]+'Ëì Ëí Ëî ÚÇ İ´ å¡ åä ìİ íõ î¡ İ¥ áø â¸ é¾ öÀ Ëò àÊ æ¶ èø êı íü ôÈ ';

hstr[19]:='Ì¡ Ì¢ Ì£ ÍØ àª ãË äâ äğ åİ é½ í³ îè õÁ ÷£ Ì¦ Ìª Ì­ Û¢ Ş· ß¾ ææ ëÄ ìÆ ';
hstr[19]:=hstr[19]+'îÑ õÌ öØ Ì´ Ìµ Ì¶ Ì· Ìº Ì» Ì¾ Û° å£ ê¼ ìş îã ïÄ ïâ ÙÎ àû äç ';
hstr[19]:=hstr[19]+'è© éÌ ï¦ ïÛ ñí ó¥ ó« ôÊ õ± Ø» ßû ä¬ èº ìâ ÷Ò ß¯ ìı í« ï« ÌÙ ';
hstr[19]:=hstr[19]+'ÌÜ ëø Ìà Ìã Ìä Ìç Ìé Ìê Ìë ÙÃ Üè ã© åÑ ç° ç¾ ğÃ ñÓ õ® Ìò Ìñ ';
hstr[19]:=hstr[19]+'Ìó Şİ ãÃ ãÙ éå î± Ù¬ Üæ ìö ñ» òè óÔ ôĞ ö¶ öæ ÷Ø İÆ ÷Ñ Ìş Í¡ ';
hstr[19]:=hstr[19]+'Í¤ Í§ Üğ İã æÃ èè î® îú òÑ öª ¶± ¶² Í© Íª Í« Í® Í± Ù¡ ÙÚ Ûí ';
hstr[19]:=hstr[19]+'Üí àÌ á¼ âú äü íÅ î× ÷» Ü¢ İ± İË îÊ õ© ŞÒ åè î¶ ÍÉ ß¯ ìÕ â½ ';
hstr[19]:=hstr[19]+'êÕ ëà Ø± Ù¢ Ûç âÕ ãû èØ èŞ éÒ íÈ îè óê õ¢ õÉ ö¾ ';

hstr[20]:='Øô æ´ ëğ Íé Íî Íï Íğ Íñ Íó Øà Ü¹ İ¸ İÒ æı çº çş ëä îµ òê Øè ŞÌ ã¯ éş ';
hstr[20]:=hstr[20]+'÷Í ÚÃ Úñ Úó Û× İÚ Ş± àø á¡ áË áÍ â« â¬ ãÇ ãí ä¢ ä¶ åÔ æ¸ çâ ';
hstr[20]:=hstr[20]+'è¸ ê¦ ì¿ ìĞ ğô ôº öÛ ÎÉ ØØ ãÓ ãë è· ö© İî Ş³ ÎÓ ÙÁ İ« à¸ á¢ ';
hstr[20]:=hstr[20]+'ä× ë¿ íÒ ö» Ø£ Øõ Úã Úù ÛØ ÜÌ ßí âĞ âä âè ä´ å» åÃ åü æÄ æğ ';
hstr[20]:=hstr[20]+'è» êõ ìÉ ğÄ ğÍ ğí òÚ öÈ ÷ù ';

hstr[21]:='ÙÒ Ùâ Úô Û­ Üç İ¾ İß İû ŞÉ ßñ áã â¾ ãÒ ä» äÀ åï çô éØ êØ êê ì¤ ì¨ ìä ';
hstr[21]:=hstr[21]+'ìù ìû ğª ñ¶ ñÓ òá ó£ ó¬ ôª ô¸ ôË ôÑ ôâ õµ õè ÷û ßÈ áò åÚ è¦ ';
hstr[21]:=hstr[21]+'èÔ íÌ ğı óÁ ÷ï Ùş ÜÈ İ² Şº á­ áı åß æµ ë¯ ìŞ ìì ğÂ ğï ò¹ óÚ ';
hstr[21]:=hstr[21]+'ôÌ õ£ õĞ õÑ ö± Ü¼ İÙ âÃ âÔ æø ç½ ó­ öß ÷Ï ßØ áÅ äì åĞ æç ç¯ ';
hstr[21]:=hstr[21]+'èÉ èÕ òÙ óã óï ÷Ì ÙÉ Ùô ÛÄ ÛÆ Ş¯ ß¢ â³ âİ äÍ å¬ åâ ç¥ çÓ é¿ ';
hstr[21]:=hstr[21]+'éÇ ò¡ õó ĞÃ ĞÆ Ø¶ Ü° ê¿ ì§ ïâ öÎ Úê Üô Üş ß© â¼ ã¬ íÊ Üº ßİ ';
hstr[21]:=hstr[21]+'á¶ âÊ âÓ äå ğ¼ õ÷ ÷Û Ú¼ ÛÃ Û× Ş£ äª ä° äÓ çï èò ìã í¹ íì ñã ';
hstr[21]:=hstr[21]+'ôÚ õ¯ ÙØ ÚÎ İæ Şï ãù äÖ äö è¯ é¸ êÑ ìÅ ìÓ íÛ îç ïà ğç Ñ¦ ÚÊ ';
hstr[21]:=hstr[21]+'àå í´ õ½ ÷¨ ¿£ Ùã Û¨ Û÷ Ü÷ Ş¦ â´ âş ä­ ä± êÖ ñ¿ õ¸ öà ';

hstr[22]:='Ûë Şë á¬ åÂ æ« çğ èâ ë² í¼ íı ğé ØÉ ØÍ Øß Ù² ÙÈ Ùğ Úİ Úç Û± Û³ Ü¾ İÎ ';
hstr[22]:=hstr[22]+'áÃ âû ãÆ ãÕ äÎ äÙ åû æÌ çü éÜ êÌ ëÙ ëç ìÍ î» óÛ õ¦ ÷Ê ÷Ğ ÷ú ';
hstr[22]:=hstr[22]+'Ññ ì¾ ìÈ í¦ òÕ Ò¨ Ô¿ Ø² Ø³ ßº áÊ áæ çÛ çò èÃ é÷ ê× ëÈ ï¢ ğÎ ';
hstr[22]:=hstr[22]+'ñº ôí ÷¥ Ò­ Ò® Ò´ Ò· Ò¸ ×§ ØÌ ÚË Úş ŞŞ êÊ ìÇ îô Ò¿ Òî Òï Ø× ';
hstr[22]:=hstr[22]+'Øæ Øî Øı Ù« Ú± Ûİ Ûü Ü² ÜÓ Üè Ş² ŞÄ ŞÈ ŞÚ ß® ß½ ß× ßŞ àÉ àæ ';
hstr[22]:=hstr[22]+'á» áÚ â¢ âÂ âø âù ã¨ éì éó êİ ì¥ ì½ ìÚ íô îÆ ï× ïî ğê ğù ñ¯ ';
hstr[22]:=hstr[22]+'ñ´ òæ ô¯ ôà ôè ôı ÷ğ Ø· Û´ Ûß Ûó Ü§ Üá ßÅ à³ áş â¹ ä¦ äÎ ë³ ';
hstr[22]:=hstr[22]+'î÷ ñ« ñ¿ ò¾ ö¯ ö¸ Ùø Û« Üã Üş İº İÓ İö Şü àÓ âß äŞ äë å­ çø ';
hstr[22]:=hstr[22]+'è¬ éº ëô ğĞ ñ¨ ò£ ó¿ Ó· Ó¸ Óº Ó» Ó½ Ó¾ ÓÁ Ù¸ ÛÕ Ü­ à¯ ã¼ çß ';
hstr[22]:=hstr[22]+'ïŞ ğ® ÷« ÷Ó ÓÔ ØÕ Øü Ù§ İ¬ İ¯ İµ ŞÌ ßÏ àó å¶ èÖ éà ë» îğ ğà ';
hstr[22]:=hstr[22]+'òÄ òÊ òö òø ôí öÏ ÷î ÷ø Ø® Ø¹ Øñ Ù¶ ÚÄ ÚÍ İÇ İÒ İ÷ Şí àô àö ';
hstr[22]:=hstr[22]+'áÎ áü âÀ âÅ â× ãĞ å÷ åı æ¥ æú è¤ êÅ êì ëé ëò ì£ ì¶ ìÏ ìÙ ìÛ ';
hstr[22]:=hstr[22]+'í² îÚ ğÁ ğÖ ğõ ğö ñ¾ ñÁ òâ òõ óÄ ô§ ô¨ ö§ ö¹ Ûù Ü« Ü¾ Şò à÷ ';
hstr[22]:=hstr[22]+'ãä æÂ è¥ éÚ ë¼ íó ğ° ó¢ óî ö½ Ùß å® èİ éĞ ë¾ îá ÔÇ ÔÉ ÔÌ ÔÍ ';
hstr[22]:=hstr[22]+'ÔÎ ÔÏ Û© Ü¿ áñ ã¢ ã³ ç¡ è¹ éæ êÀ ëµ ìÙ ';

hstr[23]:='ßÆ çŞ ŞÙ è¶ êÃ ô¢ ôØ ôõ öÉ ŞÊ æà ê° ßğ ØÆ ØÓ ßõ àı åÅ ê¾ óĞ óå ô· ÚÚ ';
hstr[23]:=hstr[23]+'çÕ êµ îÀ ï­ Şê ß¸ ßî à© é« íÄ ğä òÆ ÷ş íÎ ñ© ÚŞ Şø ì¹ ÕÎ Øë ';
hstr[23]:=hstr[23]+'Ûµ á¤ áÖ â¯ æÑ è° ó¯ ÕØ Ú¯ ßú èş îÈ óÉ Õà Õá ÚØ ß¡ èÏ éü íİ ';
hstr[23]:=hstr[23]+'ğÑ ñŞ òØ ô÷ Õç Õè Õé Õê Õì Õí Õî ÛÚ İè ä¥ äÚ çÇ èå é© é» éô ';
hstr[23]:=hstr[23]+'êâ ëÓ ëŞ ìõ î³ ğ¡ ğ² óğ Ö¡ Úº á¿ áç îÛ Ø´ Úì Û¤ Ûú ÜÆ Şı àù ';
hstr[23]:=hstr[23]+'áç âå åé åë æï èÎ è× èÙ èä éò éù êŞ ëÕ ëù ìí ìó íé ïô ğº ğë ';
hstr[23]:=hstr[23]+'òÎ ôê õ¥ õÅ õÙ õÜ õô ö£ Ú£ âì ïñ ó® ô± õà İ§ ßú æ¨ æû ç§ ëĞ ';
hstr[23]:=hstr[23]+'íØ ô¦ ôí ôü Øù Ùª Û¥ Üï ä¨ ä¾ äó èÌ éÆ éÍ ìÄ îù ğæ ğñ ñÒ óÃ ';
hstr[23]:=hstr[23]+'óç ô¶ ôã õî ÷æ ÎÎ Ò· ×§ ×­ ßù âÍ ãç ò§ Ù× ŞÊ æí çÄ Ù¾ ÚÂ ßª ';
hstr[23]:=hstr[23]+'ä· äÃ åª èş ìÌ ìú í½ ïí Üë ßÚ áÑ æ¢ æÜ ç» è÷ ê¢ êß í§ íö ïÅ ';
hstr[23]:=hstr[23]+'ïö ñè óÊ ôÒ ôô õş ö¤ ö· öö ÷Ú ÙÌ èÈ ëê ôÕ ÚÁ Úî Û¸ æã öí ×ç ';
hstr[23]:=hstr[23]+'ÙŞ İÏ ïß ß¬ çÚ õò Ş© ß¤ é× ÷® ×õ Úè ßò àÜ âô ëÑ ìñ óĞ ';

result:=s;
py:='';
j:=1;
i:=Length(Result);
while (j<=i) Do
begin
if Pos(s[j],cstr)>0 then
   begin
      py:=py+s[j];
      j:=j+1;
   end
else
begin
  hz:=s[j]+s[j+1];
  py1:=getpy2(hz);
  if py1<>char(0) then
  begin
  py:=py+py1;
  end
  else
  for k:=1 to 23 do
  begin
      if Pos(hz,hstr[k])>0 then
      begin
       py:=py+zm[k];
       break;
      end;
      if k=23 then py:=py+'!';
  end;
  j:=j+2;
end;
end;
getpy1:=py;
end;

End.
